#include <stdio.h>
#include <ctype.h> //เกี่ยวกับตัวอักษร
#include <stdbool.h> //boolean
#include <assert.h> //ตรวจสอบว่าเงื่อนไขเป็นจริงหรือไม่
#include <math.h> //ฟังก์ชันทางคณิตศาสตร์

void main (){

//-------เล่นกับ assert.h  -------------------------

/*  
################################################################################################################
    All Function
  
    1.assert(arg operater.assign arg)

################################################################################################################
*/

    //fn assert(arg operater.assign arg) : ตรวจสอบว่าเงื่อนไขเป็นจริงหรือไม่ => ถ้าจริงให้ทำงานบบรทัดต่อไป
    
    /*
    int a = 10;
    char b ='B';
    assert (a>9);
    printf("OK\n");
    assert (b=='C');
    printf("OK/n");
    */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++

//-------เล่นกับ assert.h-------------------------


//-------เล่นกับ ctype.h  -------------------------

/*  
################################################################################################################
    All Function
  
      1.isalnum(argument) : ตรวจสอบว่าเป็นเลขหรืออักษรหรือไม่
      2.isalpha(argument) : ตรวจสอบว่าเป็นอักษร a-z หรือไม่
      3.iscntrl(argument) : ตรวจสอบ control character จำพวก example, backspace, Escape, newline etc
      4.isprint(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรแสดงผลผ่านหน้าจอได้หรือไม่
      5.isdigit(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวเลข 0 ถึง 9 หรือไม่
      6.isxdigit(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวเลขฐาน 16 หรือไม่
      7.isgraph(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นอักษรกราฟฟิก(ตัวที่นอกเหนือจาก control char)หรือไม่
      8.ispunct(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นอักษรพิเศษหรือไม่
      9.isspace(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวcontrol white space หรือไม่
      10.islower(arg) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวพิมพ์เล็กหรือไม่
      11.isupper(arg) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวพิมพ์ใหญ่หรือไม่
      12.tolower(arg) : แปลงพิมพ์เล็ก->ใหญ่
      13.toupper(arg) : แปลงพิมพ์ใหญ่->เล็ก

################################################################################################################
*/    
    //fn isalnum(argument) : ตรวจสอบว่าเป็นเลขหรืออักษรหรือไม่

        /*
        char a ='A';
        char b =' ';
        bool typeA = isalnum(a);
        printf("%d\n%d",typeA,isalnum(b));

        //วิธีลัด
        printf("\n");
        printf("\n%d",isalnum(a) ? 1 : 0); 
        */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++

    //fn isalpha(argument) : ตรวจสอบว่าเป็นอักษร a-z หรือไม่

        /*
        char a ='A';
        char b =' '
        ,c = '1';
        printf("%d\n%d\n%d",isalpha(a),isalpha(b),isalpha(c));
        */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++

    //fn iscntrl(argument) : ตรวจสอบ control character จำพวก example, backspace, Escape, newline etc

        /*
        char a ='A';
        char b =' ',c = '\n';
        printf ("%d\n%d\n%d",iscntrl(a),iscntrl(b),iscntrl(c));
        */
    
    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++

    //fn isprint(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรแสดงผลผ่านหน้าจอได้หรือไม่

        /*
        char a ='A';
        char b ='\n';
        printf("%d\n%d",isprint(a),isprint(b));
        */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++

    //fn isdigit(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวเลข 0 ถึง 9 หรือไม่

        
        // char a ='A';
        // char b ='5';
        // printf("%d\n%d",isdigit(a),isdigit(b));
        

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++ 

    //fn isxdigit(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวเลขฐาน16หรือไม่

        /*
        char a ='A';
        char b ='5';
        printf("%d\n%d",isxdigit(a),isxdigit(b));
        */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++ 

    //fn isgraph(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นอักษรกราฟฟิก(ตัวที่นอกเหนือจาก control char)หรือไม่

        /*
        char a ='A';
        char b ='\n',c = '-';
        printf("%d\n%d\n%d",isgraph(a),isgraph(b),isgraph(c));
        */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++ 

    //fn ispunct(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นอักษรพิเศษหรือไม่

        /*
        char a ='A';
        char b ='5',c = ';';

        printf("%d\n%d\n%d",ispunct(a),ispunct(b),ispunct(c));
        */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++

    //fn isspace(argument) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวcontrol white space หรือไม่
        /*  ' '	space
            '\n'	newline
            '\t'	horizontal tab
            '\v'	vertical tab
            '\f'	form feed
            '\r'	Carraige return
        */

        /*
        char a ='A';
        char b ='5',c = '\n';

        printf("%d\n%d\n%d",isspace(a),isspace(b),isspace(c));
        */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++

    //fn islower(arg) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวพิมพ์เล็กหรือไม่

        /*
        char a = 'A';
        char b = 'b';
        printf("%d\n%d",islower(a),islower(b));
        */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++ 

    //fn isupper(arg) : ตรวจสอบว่าข้อมูลที่อยู่ในตัวแปรเป็นตัวพิมพ์ใหญ่หรือไม่

        /*
        char a = 'A';
        char b = 'b';
        printf("%d\n%d",isupper(a),isupper(b));
        */

    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++ 

    //fn tolower(arg) : แปลงพิมพ์เล็ก->ใหญ่
        /*
        char a = 'A';
        char b = 'b';
        printf("%d : %c\n%d : %c",tolower(a),tolower(a),tolower(b),tolower(b));
        */
       
    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++ 


    //fn toupper(arg) : แปลงพิมพ์ใหญ่->เล็ก

        /*
        char a = 'A';
        char b = 'b';
        printf("%d : %c\n%d : %c",toupper(a),toupper(a),toupper(b),toupper(b));
        */
       
    //+++++++++++++++++++++++++++++++++++++++++++++++++++++++ 
    
    
    //-------เล่นกับ ctype.h  -------------------------

    //-------เล่นกับ math.h  -------------------------

/*  
################################################################################################################
    All Function
  
    1.sin() : หาค่าsin()
    2.cos() : หาค่าcos()
    2.tan() : หาค่าtan()

################################################################################################################
*/
//fn sin(argument:มุมพาย) : แปลงมุมพาย->เรเดียน
    /*
    printf("%.2f\n",sin(3.14159654/2));//sin 90 = 1
    printf("%.2f",sin(0));//sin 0 = 0
    */   

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++

//fn cos(argument:มุมพาย) : แปลงมุมพาย->เรเดียน
    /*
    printf("%.2f\n",cos(3.14159654));//cos 180 = -1
    printf("%.2f",cos(0));//cos 0 = 1
    */    

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++

//fn tan(argument:มุมพาย) : แปลงมุมพาย->เรเดียน
    /*
    printf("%.2f\n",tan(3.14159654/4));//tan 45 = 1
    printf("%.2f",tan(0));//tan 0 = 0
    */   
   
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++
    //-------เล่นกับ math.h  -------------------------




}
 